IvYehor/stm32calc/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LEDPCB_Pin GPIO_PIN_13
#define LEDPCB_GPIO_Port GPIOC
#define ADDCHBUTTON_Pin GPIO_PIN_0
#define ADDCHBUTTON_GPIO_Port GPIOA
#define ADDCHBUTTON_EXTI_IRQn EXTI0_IRQn
#define LEFTBUTTON_Pin GPIO_PIN_2
#define LEFTBUTTON_GPIO_Port GPIOA
#define LEFTBUTTON_EXTI_IRQn EXTI2_IRQn
#define RIGHTBUTTON_Pin GPIO_PIN_3
#define RIGHTBUTTON_GPIO_Port GPIOA
#define RIGHTBUTTON_EXTI_IRQn EXTI3_IRQn
#define MENUBUTTON_Pin GPIO_PIN_4
#define MENUBUTTON_GPIO_Port GPIOA
#define MENUBUTTON_EXTI_IRQn EXTI4_IRQn
#define ADDCH1BUTTON_Pin GPIO_PIN_5
#define ADDCH1BUTTON_GPIO_Port GPIOA
#define ADDCH1BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define ADDCH2BUTTON_Pin GPIO_PIN_6
#define ADDCH2BUTTON_GPIO_Port GPIOA
#define ADDCH2BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define EQBUTTON_Pin GPIO_PIN_7
#define EQBUTTON_GPIO_Port GPIOA
#define EQBUTTON_EXTI_IRQn EXTI9_5_IRQn
#define BACKBUTTON_Pin GPIO_PIN_1
#define BACKBUTTON_GPIO_Port GPIOB
#define BACKBUTTON_EXTI_IRQn EXTI1_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
